УТ_для_edt/src/Documents/СообщениеSMS/СообщениеSMS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СообщениеSMS</name>
  <basedOn>Document.Встреча</basedOn>
  <basedOn>Document.ЗапланированноеВзаимодействие</basedOn>
  <basedOn>Document.ТелефонныйЗвонок</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоВходящее</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоИсходящее</basedOn>
  <basedOn>Document.СообщениеSMS</basedOn>
  <basedOn>Document.CRM_Интерес</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокУчастников</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВзаимодействиеОснование</name>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
      <types>DocumentRef.РассылкаКлиентам</types>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЗапланированноеВзаимодействие</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.CRM_Телемаркетинг</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>DocumentRef.удалитьCRM_Мероприятие</types>
      <types>DocumentRef.Встреча</types>
      <types>BusinessProcessRef.CRM_БизнесПроцесс</types>
      <types>DocumentRef.СообщениеSMS</types>
      <types>CatalogRef.ВидыОповещенийКлиентам</types>
      <types>DocumentRef.УдалитьCRM_Событие</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьВТранслите</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДокументаСообщениеSMS</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКогдаОтправить</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктуальностиОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПодразделениеЗаказчик</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>SMS4B_ТипСообщения</name>
    <comment>Тип сообщения</comment>
    <type>
      <types>EnumRef.SMS4B_ТипыСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>SMS4B_ИмяОтправителя</name>
    <comment>Имя или номер отправителя</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>SMS4B_СтатусСтрокой</name>
    <comment>Статус строкой</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>SMS4B_ЕстьАвтотекст</name>
    <comment>АПК:1032 АПК:87 АПК:265 не проверять на орфографию</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SMS4B_РавномернаяРассылка</name>
    <comment>Равномерная рассылка</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SMS4B_ФлагАктуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SMS4B_ИспользоватьПериодЗапрета</name>
    <comment>Использовать период запрета</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SMS4B_НачалоПериодаЗапрета</name>
    <comment>Начало периода запрета</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SMS4B_КонецПериодаЗапрета</name>
    <comment>Конец периода запрета</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Адресаты</name>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеКонтакта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КакСвязаться</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДляОтправки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСообщения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеСообщения</name>
      <type>
        <types>EnumRef.СостоянияСообщенияSMS</types>
      </type>
    </attributes>
    <attributes>
      <name>SMS4B_ТекстСообщения</name>
      <comment>Текст сообщения</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>SMS4B_ДатаЗавершения</name>
      <comment>Дата завершения</comment>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>SMS4B_МиллисекундаЗавершения</name>
      <comment>Количество миллисекунд даты завершения сообщения</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>CRM_СправочникПартнерыЧастноеЛицо</name>
      <description>Контактная информация справочника &quot;Клиенты&quot; (для физических лиц)</description>
    </items>
    <items>
      <name>CRM_СправочникПартнерыКомпания</name>
      <description>Контактная информация справочника &quot;Клиенты&quot; (для юридических лиц)</description>
    </items>
    <items>
      <name>СправочникКонтактныеЛицаПартнеров</name>
      <description>Контактная информация справочника &quot;Контактные лица партнеров&quot;</description>
    </items>
    <items>
      <name>СправочникКонтрагенты</name>
      <description>Контактная информация справочника &quot;Контрагенты&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникПартнеры</name>
      <description>Контактная информация справочника &quot;Партнеры&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникCRM_ПотенциальныеКлиенты</name>
      <description>Контактная информация справочника &quot;Потенциальные клиенты&quot;</description>
    </items>
    <items>
      <name>СправочникРегистрацииВНалоговомОргане</name>
      <description>Контактная информация справочника &quot;Регистрации в налоговом органе&quot;</description>
    </items>
    <items>
      <name>СправочникСклады</name>
      <description>Контактная информация справочника &quot;Склады&quot;</description>
    </items>
    <items>
      <name>СправочникТорговыеТочки</name>
      <description>Контактная информация справочника &quot;Торговые точки&quot;</description>
    </items>
    <items>
      <name>СправочникФизическиеЛица</name>
      <description>Контактная информация справочника &quot;Физические лица&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРедактирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИспользоватьДляОповещений</name>
    <comment>Использовать для оповещений</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИмяПредопределенногоЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсправлятьУстаревшиеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаскаНомераТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводитьНомерПоМаске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерТелефона</name>
    <comment>#1651 смарт: Лопато / Телефония. Хранение истории контактной информации пользователей</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартОписание</name>
    <comment>#1776 смарт: Ермаков 19.04.2024 / Телефон в карточке пользователя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/CommonModules/CRM_УправлениеКонтактнойИнформациейКлиент/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Контактная информация".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Обработчик события ПриИзменении поля формы контактной информации.
// Вызывается из подключаемых действий при внедрении подсистемы "Контактная информация".
//
// Параметры:
//     Форма             - ФормаКлиентскогоПриложения - Форма владельца контактной информации.
//     Элемент           - ПолеФормы        - Элемент формы, содержащий представление контактной информации.
//     ЭтоТабличнаяЧасть - Булево           - Флаг того, что элемент является частью таблицы формы.
//
Процедура ПриИзменении(Форма, Элемент, ЭтоТабличнаяЧасть = Ложь) Экспорт

	ЭтоТабличнаяЧасть = ЭтоТабличнаяЧасть(Элемент);
	
	Если ЭтоТабличнаяЧасть Тогда
		ДанныеЗаполнения = Форма.Элементы[Форма.ТекущийЭлемент.Имя].ТекущиеДанные;
		Если ДанныеЗаполнения = Неопределено Тогда
			Возврат;
		КонецЕсли;
	Иначе
		ДанныеЗаполнения = Форма;
	КонецЕсли;
	
	// Если это очистка, то сбрасываем представление.
	ДанныеСтроки = ПолучитьСтрокуДополнительныхЗначений(Форма, Элемент, ЭтоТабличнаяЧасть);
	Если ДанныеСтроки = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
// +CRM
	Попытка
		Если Элемент.Вид <> ВидПоляФормы.ПолеНадписи Тогда
			Текст = СокрЛП(Элемент.ТекстРедактирования);
			Форма[ДанныеСтроки.ИмяРеквизита] = Текст;
		Иначе
			Текст = Форма[ДанныеСтроки.ИмяРеквизита];
		КонецЕсли; 
	Исключение
	КонецПопытки;
	//Текст = Элемент.ТекстРедактирования;
// -CRM
	
	Если ПустаяСтрока(Текст) Тогда
		
		ДанныеЗаполнения[Элемент.Имя] = "";
		Если ЭтоТабличнаяЧасть Тогда
			ДанныеЗаполнения[Элемент.Имя + "Значение"] = "";
		КонецЕсли;
		ДанныеСтроки.Представление = "";
		ДанныеСтроки.Значение      = "";
		Результат = Новый Структура("ОбновитьКонтекстноеМеню, ИмяЭлементаДляРазмещения", Истина, ДанныеСтроки.ИмяЭлементаДляРазмещения);
		Если ДанныеСтроки.ИмяЭлементаДляРазмещения <> "" Тогда
			ОбновитьКонтекстноеМеню(Форма, ДанныеСтроки.ИмяЭлементаДляРазмещения);
		КонецЕсли;
		Возврат;
		
	КонецЕсли;
	
	// +CRM
	// Разложить строку телефона по полям
	Если ДанныеСтроки.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон")
		ИЛИ ДанныеСтроки.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Факс") Тогда
		СтруктураТелефона = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(Текст);
		ДанныеСтроки.Представление = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураТелефона.КодСтраны, СтруктураТелефона.КодГорода, СтруктураТелефона.НомерТелефона, СтруктураТелефона.Добавочный, "");
		ЗначенияПолей = Новый Структура;
		ЗначенияПолей.Вставить("countryCode", СтруктураТелефона.КодСтраны);
		ЗначенияПолей.Вставить("areaCode", СтруктураТелефона.КодГорода);
		ЗначенияПолей.Вставить("number", СтруктураТелефона.НомерТелефона);
		ЗначенияПолей.Вставить("extNumber", СтруктураТелефона.Добавочный);
		ЗначенияПолей.Вставить("value", ДанныеСтроки.Представление);
		ЗначенияПолей.Вставить("comment", ДанныеСтроки.Комментарий);
		ДанныеСтроки.Значение = CRM_ОбщегоНазначенияСервер.СтруктураВСтрокуJSON(ЗначенияПолей);
		Попытка
			Форма[ДанныеСтроки.ИмяРеквизита] = ДанныеСтроки.Представление;
		Исключение
		КонецПопытки;
	Иначе
	// -CRM
	ДанныеСтроки.Значение = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(Текст, ДанныеСтроки.Вид);
	ДанныеСтроки.Представление = Текст;
	
	Если ЭтоТабличнаяЧасть Тогда
		ДанныеЗаполнения[Элемент.Имя + "Значение"]      = ДанныеСтроки.Значение;
	КонецЕсли;
	// +CRM
	КонецЕсли;
	// -CRM
	
	Если ДанныеСтроки.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
		Результат = Новый Структура("ОбновитьКонтекстноеМеню, ИмяЭлементаДляРазмещения", Истина, ДанныеСтроки.ИмяЭлементаДляРазмещения);
		ОбновитьКонтактнуюИнформациюФормы(Форма, Результат)
	КонецЕсли;
		
КонецПроцедуры

// Обработчик события НачалоВыбора поля формы контактной информации.
// Вызывается из подключаемых действий при внедрении подсистемы "Контактная информация".
//
// Параметры:
//     Форма                - ФормаКлиентскогоПриложения - Форма владельца контактной информации.
//     Элемент              - ПолеФормы        - Элемент формы, содержащий представление контактной информации.
//     Модифицированность   - Булево           - Устанавливаемый флаг модифицированности формы.
//     СтандартнаяОбработка - Булево           - Устанавливаемый флаг стандартной обработки события формы.
//
Процедура НачалоВыбора(Форма, Элемент, Модифицированность = Истина, СтандартнаяОбработка = Ложь) Экспорт
	СтандартнаяОбработка = Ложь;
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяРеквизита", Элемент.Имя);
	
	ЭтоТабличнаяЧасть = ЭтоТабличнаяЧасть(Элемент);
	
	Если ЭтоТабличнаяЧасть Тогда
		ДанныеЗаполнения = Форма.Элементы[Форма.ТекущийЭлемент.Имя].ТекущиеДанные;
		Если ДанныеЗаполнения = Неопределено Тогда
			Возврат;
		КонецЕсли;
	Иначе
		ДанныеЗаполнения = Форма;
	КонецЕсли;
	
	ДанныеСтроки = ПолучитьСтрокуДополнительныхЗначений(Форма, Элемент, ЭтоТабличнаяЧасть);
	
	//// Если представление было изменено в поле и не соответствует реквизиту, то приводим в соответствие.
	ОбновитьКонтекстноеМеню = Ложь;
	Если Элемент.Вид = ВидПоляФормы.ПолеВвода Тогда
		Если ДанныеЗаполнения[Элемент.Имя] <> Элемент.ТекстРедактирования Тогда
			ДанныеЗаполнения[Элемент.Имя] = Элемент.ТекстРедактирования;
			ПриИзменении(Форма, Элемент, ЭтоТабличнаяЧасть);
			ОбновитьКонтекстноеМеню  = Истина;
			Форма.Модифицированность = Истина;
		КонецЕсли;
		ТекстРедактирования = Элемент.ТекстРедактирования;
	Иначе 
		ТекстРедактирования = ?(ЗначениеЗаполнено(ДанныеСтроки.Значение), Форма[Элемент.Имя], "");
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВидКонтактнойИнформации", ДанныеСтроки.Вид);
	ПараметрыОткрытия.Вставить("Представление", ДанныеСтроки.Представление);
	ПараметрыОткрытия.Вставить("КонтактнаяИнформацияОписаниеДополнительныхРеквизитов", Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов);
	// +CRM
	ПараметрыОткрытия.Вставить("БылиВнесеныИзменения", Ложь);
	Если CRM_ОбщегоНазначенияСервер.ПоТипуКонтактнойИнформацииПолучитьНомер(ДанныеСтроки.Тип) = 2 Тогда
		// +СофтФон
		врКодСтраны		= Неопределено;
		врКодГорода		= Неопределено;
		врНомерТелефона	= Неопределено;
		врПредставление	= Неопределено;
		// -СофтФон
		Если УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВJSON(ДанныеСтроки.Значение) Тогда
			// +СофтФон
			ЗначенияПолей = CRM_ОбщегоНазначенияСервер.JSONВКонтактнуюИнформациюПоПолям(ДанныеСтроки.Значение, ДанныеСтроки.Тип);
			Если ЗначениеЗаполнено(ЗначенияПолей.value) И НЕ (ПараметрыОткрытия.Представление = ЗначенияПолей.value) Тогда
				ПараметрыОткрытия.Представление			= ЗначенияПолей.value;
				ПараметрыОткрытия.БылиВнесеныИзменения	= Истина;
			КонецЕсли;	
			врПредставление	= "";
			// -СофтФон
		Иначе
			ЗначенияПолей = Новый Структура;
		КонецЕсли;
		// +СофтФон
		Для Каждого СтрокаЗначения Из ЗначенияПолей Цикл
			Если СтрокаЗначения.Ключ = "value" Тогда
				Если ЗначениеЗаполнено(СтрокаЗначения.Значение) И НЕ (ПараметрыОткрытия.Представление = СтрокаЗначения.Значение) Тогда
					ПараметрыОткрытия.Представление			= СтрокаЗначения.Значение;
					ПараметрыОткрытия.БылиВнесеныИзменения	= Истина;
				КонецЕсли;	
				врПредставление	= "";
			ИначеЕсли СтрокаЗначения.Ключ = "countryCode" Тогда
				врКодСтраны = СокрЛП(СтрокаЗначения.Значение); 
			ИначеЕсли СтрокаЗначения.Ключ = "areaCode" Тогда
				врКодГорода = СокрЛП(СтрокаЗначения.Значение); 
			ИначеЕсли СтрокаЗначения.Ключ = "number" Тогда
				врНомерТелефона = СокрЛП(СтрокаЗначения.Значение); 
			КонецЕсли;
		КонецЦикла;
		// +СофтФон
		Если врКодСтраны = Неопределено Тогда
			ЗначенияПолей.Вставить("countryCode", "");
		КонецЕсли;	
		Если врКодГорода = Неопределено Тогда
			ЗначенияПолей.Вставить("areaCode", "");
		КонецЕсли;	                
		Если врНомерТелефона = Неопределено Тогда
			ЗначенияПолей.Вставить("number", "");
		КонецЕсли;	
		Если врПредставление = Неопределено Тогда
			ЗначенияПолей.Вставить("value", "");
		КонецЕсли;	
		врПредставление = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(ПараметрыОткрытия.Представление, Ложь);
		Если ЗначениеЗаполнено(врПредставление) Тогда
			Если СтрДлина(врПредставление) > 5 Тогда
				сфпСофтФонПроКлиент.сфпЗаполнитьПрефиксыИНастройки();	
				// В представлении есть номер телефона.
				ПараметрыСервера = сфпСофтФонПроСервер.сфпПараметрыСервера();
				// Получаем структуру полей по представлению.
				СтруктураНомера = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(ПараметрыОткрытия.Представление);
				// Если не заполнены код страны или код города, то заполняем их по умолчанию.
				Если НЕ ЗначениеЗаполнено(СтруктураНомера.КодСтраны) Тогда
					СтруктураНомера.КодСтраны = ПараметрыСервера.КодСтраны;
				КонецЕсли;	
				Если НЕ ЗначениеЗаполнено(СтруктураНомера.КодГорода) Тогда
					СтруктураНомера.КодГорода = ПараметрыСервера.КодГорода;
				КонецЕсли;	
				// Заполняем значения из структуры.
				Если НЕ (ЗначенияПолей.countryCode = СтруктураНомера.КодСтраны) Тогда
					ЗначенияПолей.Вставить("countryCode", СтруктураНомера.КодСтраны);
					ПараметрыОткрытия.БылиВнесеныИзменения	= Истина;
				КонецЕсли;	
				Если НЕ (ЗначенияПолей.areaCode = СтруктураНомера.КодГорода) Тогда
					ЗначенияПолей.Вставить("areaCode", СтруктураНомера.КодГорода);
					ПараметрыОткрытия.БылиВнесеныИзменения	= Истина;
				КонецЕсли;	
				Если НЕ (ЗначенияПолей.number = СтруктураНомера.НомерТелефона) Тогда
					ЗначенияПолей.Вставить("number", СтруктураНомера.НомерТелефона);
					ПараметрыОткрытия.БылиВнесеныИзменения	= Истина;
				КонецЕсли;	
				Если НЕ (ЗначенияПолей.value = ПараметрыОткрытия.Представление) Тогда
					ЗначенияПолей.Вставить("value", ПараметрыОткрытия.Представление);
					ПараметрыОткрытия.БылиВнесеныИзменения	= Истина;
				КонецЕсли;	
				Если НЕ (ЗначенияПолей.extNumber = СтруктураНомера.Добавочный) Тогда
					ЗначенияПолей.Вставить("extNumber", СтруктураНомера.Добавочный);
					ПараметрыОткрытия.БылиВнесеныИзменения	= Истина;
				КонецЕсли;	
			Иначе	
				сфпСофтФонПроКлиент.сфпЗаполнитьПрефиксыИНастройки();					
				// Заполним код страны и код города по умолчанию.
				ПараметрыСервера = сфпСофтФонПроСервер.сфпПараметрыСервера();
				Если НЕ ЗначениеЗаполнено(ЗначенияПолей.countryCode) Тогда
					ЗначенияПолей.Вставить("countryCode", ПараметрыСервера.КодСтраны);
					ПараметрыОткрытия.БылиВнесеныИзменения	= Истина;
				КонецЕсли;	
				Если НЕ ЗначениеЗаполнено(ЗначенияПолей.areaCode) 
					И ((СтрДлина(ПараметрыСервера.КодГорода) + СтрДлина(врПредставление)) = 10) Тогда
					ЗначенияПолей.Вставить("areaCode", ПараметрыСервера.КодГорода);
					ПараметрыОткрытия.БылиВнесеныИзменения 	= Истина;
				КонецЕсли;	
				Если НЕ (ЗначенияПолей.number = врПредставление) Тогда
					ЗначенияПолей.Вставить("number", врПредставление);
					ПараметрыОткрытия.БылиВнесеныИзменения	= Истина;
				КонецЕсли;	
				Если НЕ (ЗначенияПолей.value = ПараметрыОткрытия.Представление) Тогда
					ЗначенияПолей.Вставить("value", ПараметрыОткрытия.Представление);
					ПараметрыОткрытия.БылиВнесеныИзменения 	= Истина;
				КонецЕсли;	
			КонецЕсли;
		Иначе	
			сфпСофтФонПроКлиент.сфпЗаполнитьПрефиксыИНастройки();				
			// Если это новый номер, то заполним код страны и код города по умолчанию.
			ПараметрыСервера = сфпСофтФонПроСервер.сфпПараметрыСервера();
			Если ПустаяСтрока(ЗначенияПолей.countryCode) Тогда
				ЗначенияПолей.Вставить("countryCode", ПараметрыСервера.КодСтраны);
				ПараметрыОткрытия.БылиВнесеныИзменения	= Истина;
			КонецЕсли;	
			Если СтрНайти(CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(ДанныеСтроки.Вид, "ИмяПредопределенныхДанных"), "Мобильный") = 0 Тогда
				Если ПустаяСтрока(ЗначенияПолей.areaCode) Тогда
					ЗначенияПолей.Вставить("areaCode", ПараметрыСервера.КодГорода);
					ПараметрыОткрытия.БылиВнесеныИзменения	= Истина;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
		Если ПараметрыОткрытия.БылиВнесеныИзменения Тогда
			ПараметрыОткрытия.Вставить("ЗначенияПолей", CRM_ОбщегоНазначенияСервер.СтруктураВСтрокуJSON(ЗначенияПолей));
		КонецЕсли;	
		Форма[Элемент.Имя] = ПараметрыОткрытия.Представление;
		Если ДанныеСтроки.Свойство("сфпВремяЗадержкиНабораДобавочногоНомера") Тогда
			ПараметрыОткрытия.Вставить("сфпВремяЗадержкиНабораДобавочногоНомера", ДанныеСтроки.сфпВремяЗадержкиНабораДобавочногоНомера);
		КонецЕсли;
		// -СофтФон
	КонецЕсли;
	// -CRM
	Если НЕ ПараметрыОткрытия.Свойство("ЗначенияПолей") Тогда
		ПараметрыОткрытия.Вставить("Значение", ДанныеСтроки.Значение);
	КонецЕсли;
	Если Не ЭтоТабличнаяЧасть Тогда
		ПараметрыОткрытия.Вставить("Комментарий", ДанныеСтроки.Комментарий);
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ПредставлениеНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура);
	Оповещение.ДополнительныеПараметры.Вставить("ДанныеЗаполнения",  ДанныеЗаполнения);
	Оповещение.ДополнительныеПараметры.Вставить("ЭтоТабличнаяЧасть", ЭтоТабличнаяЧасть);
	Оповещение.ДополнительныеПараметры.Вставить("ДанныеСтроки",      ДанныеСтроки);
	Оповещение.ДополнительныеПараметры.Вставить("Элемент",           Элемент);
	Оповещение.ДополнительныеПараметры.Вставить("Результат",         Результат);
	Оповещение.ДополнительныеПараметры.Вставить("Форма",             Форма);
	Оповещение.ДополнительныеПараметры.Вставить("ОбновитьКонтекстноеМеню", ОбновитьКонтекстноеМеню);
	Оповещение.ДополнительныеПараметры.Вставить("ИмяЭлементаРазмещения", ДанныеСтроки.ИмяЭлементаДляРазмещения);

	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыОткрытия,, Оповещение);

КонецПроцедуры

// Обработчик команды, связанной с контактной информации (написать письмо, открыть адрес, и т.п.).
// Вызывается из подключаемых действий при внедрении подсистемы "Контактная информация".
//
// Параметры:
//     Форма      - ФормаКлиентскогоПриложения - Форма владельца контактной информации.
//     ИмяКоманды - Строка           - Имя автоматически сгенерированной команды действия.
//
Процедура ВыполнитьКоманду(Знач Форма, Знач ИмяКоманды) Экспорт
	
	Если СтрНачинаетсяС(ИмяКоманды, "КонтактнаяИнформацияДобавитьПолеВвода") Тогда
		
		ИмяЭлементаДляРазмещения = Сред(ИмяКоманды, СтрДлина("КонтактнаяИнформацияДобавитьПолеВвода") + 1);
		Оповещение = Новый ОписаниеОповещения("КонтактнаяИнформацияДобавитьПолеВводаЗавершение", ЭтотОбъект, Новый Структура);
		Оповещение.ДополнительныеПараметры.Вставить("Форма", Форма);
		Оповещение.ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", ИмяЭлементаДляРазмещения);
		Оповещение.ДополнительныеПараметры.Вставить("ИмяКоманды", ИмяКоманды);
		// +CRM
		//Форма.ПоказатьВыборИзМеню(Оповещение, Форма.ПараметрыКонтактнойИнформации.СписокДобавляемыхЭлементов, Форма.Элементы.КонтактнаяИнформацияДобавитьПолеВвода);
		СписокДобавляемыхЭлементовКонтактнойИнформации	= Новый СписокЗначений;
		Для Каждого ЭлементСписка Из Форма.ПараметрыКонтактнойИнформации[ИмяЭлементаДляРазмещения].СписокДобавляемыхЭлементов Цикл
			СписокДобавляемыхЭлементовКонтактнойИнформации.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление, ЭлементСписка.Пометка, ЭлементСписка.Картинка);
		КонецЦикла;
		СписокДобавляемыхЭлементовКонтактнойИнформации.СортироватьПоПредставлению(НаправлениеСортировки.Возр);
		Если Найти(Форма.ИмяФормы, ".Партнеры") > 0 Тогда
			// Удаляем лишние виды КИ
			МассивВладельцевКИ = Новый Массив;
			МассивВладельцевКИ.Добавить(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.СправочникПартнеры"));
			Если Форма.Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.КомпанияЧастноеЛицо.Компания") Тогда
				МассивВладельцевКИ.Добавить(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.CRM_СправочникПартнерыКомпания"));
			ИначеЕсли Форма.Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.КомпанияЧастноеЛицо.ЧастноеЛицо") Тогда
				МассивВладельцевКИ.Добавить(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.CRM_СправочникПартнерыЧастноеЛицо"));
			КонецЕсли;
			// Удаляем 
			Для Каждого ЭлементОписания Из Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
				Если МассивВладельцевКИ.Найти(ЭлементОписания.Родитель) = Неопределено Тогда
					Для каждого ЭлементСписка Из СписокДобавляемыхЭлементовКонтактнойИнформации Цикл
						Если ЭлементСписка.Значение.Ссылка = ЭлементОписания.Вид Тогда
							СписокДобавляемыхЭлементовКонтактнойИнформации.Удалить(ЭлементСписка);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
		Попытка
			РедактироватьДР = Форма.РедактироватьДР;
		Исключение
			РедактироватьДР = Истина;
		КонецПопытки;	
		Если НЕ РедактироватьДР Тогда
			// Удаляем из списка выбора скрытые элементы КИ.
			Для Каждого ЭлементОписания Из Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
				Если НЕ ЭлементОписания.Выводить Тогда
					ЭлементСписка = СписокДобавляемыхЭлементовКонтактнойИнформации.НайтиПоЗначению(ЭлементОписания.Вид);
					Если НЕ (ЭлементСписка = Неопределено) Тогда
						СписокДобавляемыхЭлементовКонтактнойИнформации.Удалить(ЭлементСписка);
					КонецЕсли;
				КонецЕсли;			
			КонецЦикла;	
		КонецЕсли;	
		Форма.ПоказатьВыборИзМеню(Оповещение, СписокДобавляемыхЭлементовКонтактнойИнформации, Форма.Элементы[ИмяКоманды]);
		// -CRM	
		
		Возврат;
		
	ИначеЕсли СтрНачинаетсяС(ИмяКоманды, "Команда") Тогда
		
		ИмяРеквизита = СтрЗаменить(ИмяКоманды, "Команда", "");
		КомандаКонтекстногоМеню = Неопределено;
		
	ИначеЕсли СтрНачинаетсяС(ИмяКоманды, "МенюПодменюАдрес") Тогда
		
		ИмяРеквизита         = СтрЗаменить(ИмяКоманды, "МенюПодменюАдрес", "");
		Позиция              = СтрНайти(ИмяРеквизита, "_КонтактнаяИнформацияПоле");
		ИмяРеквизитаИсточник = Лев(ИмяРеквизита, Позиция -1);
		ИмяРеквизита         = Сред(ИмяРеквизита, Позиция + 1);
		КомандаКонтекстногоМеню = Неопределено;
		
	ИначеЕсли СтрНачинаетсяС(ИмяКоманды, "КартаЯндексМеню") 
		ИЛИ СтрНачинаетсяС(ИмяКоманды, "КартаGoogleМеню") Тогда
		
		КомандаКонтекстногоМеню = КомандаКонтекстногоМеню(ИмяКоманды);
		ИмяРеквизита = Сред(КомандаКонтекстногоМеню.ИмяРеквизита, СтрДлина("Меню") + 1);
		
	Иначе
		КомандаКонтекстногоМеню = КомандаКонтекстногоМеню(ИмяКоманды);
		ИмяРеквизита = КомандаКонтекстногоМеню.ИмяРеквизита;
	КонецЕсли;
	
	Результат = Новый Структура("ИмяРеквизита", ИмяРеквизита);
	НайденнаяСтрока = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Результат)[0];
	ТипКонтактнойИнформации = НайденнаяСтрока.Тип;
	ИмяЭлементаДляРазмещения = НайденнаяСтрока.ИмяЭлементаДляРазмещения;
	Результат.Вставить("ИмяЭлементаДляРазмещения", ИмяЭлементаДляРазмещения);
	
	Если КомандаКонтекстногоМеню <> Неопределено Тогда
		Если КомандаКонтекстногоМеню.Команда = "Комментарий" Тогда
			ВвестиКомментарий(Форма, КомандаКонтекстногоМеню.ИмяРеквизита, НайденнаяСтрока, Результат);
		ИначеЕсли КомандаКонтекстногоМеню.Команда = "История" Тогда
			УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуИсторииИзменений(Форма, НайденнаяСтрока);
		ИначеЕсли КомандаКонтекстногоМеню.Команда = "КартаЯндекс" Тогда
			УправлениеКонтактнойИнформациейКлиент.ПоказатьАдресНаКарте(НайденнаяСтрока.Представление, "Яндекс.Карты");
		ИначеЕсли КомандаКонтекстногоМеню.Команда = "КартаGoogle" Тогда
			УправлениеКонтактнойИнформациейКлиент.ПоказатьАдресНаКарте(НайденнаяСтрока.Представление, "GoogleMaps");
		Иначе
			ПервыйЭлемент = НайденнаяСтрока.ИмяРеквизита;
			Индекс =Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Индекс(НайденнаяСтрока);
			// +CRM
			//Если КомандаКонтекстногоМеню.НаправлениеПеремещения = 1 Тогда
			//	Если Индекс < Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Количество() - 1 Тогда
			//		ВторойЭлемент = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Получить(Индекс + 1).ИмяРеквизита;
			//	КонецЕсли;
			//Иначе
			//	Если Индекс > 0 Тогда
			//		ВторойЭлемент = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Получить(Индекс - 1).ИмяРеквизита;
			//	КонецЕсли;
			//КонецЕсли;
			ТаблицаКонтактнойИнформации = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов;
			
			ОтборПоВидуИКолонке = Новый Структура("Вид, Колонка", НайденнаяСтрока.Вид, НайденнаяСтрока.Колонка);
			НайденныеСтроки = ТаблицаКонтактнойИнформации.НайтиСтроки(ОтборПоВидуИКолонке);
			СписокНайденныхСтрок = Новый СписокЗначений;
			СписокНайденныхСтрок.ЗагрузитьЗначения(НайденныеСтроки);
			СтрокаСписка = СписокНайденныхСтрок.НайтиПоЗначению(НайденнаяСтрока);
			
			Если КомандаКонтекстногоМеню.НаправлениеПеремещения = 1 Тогда
				Если СписокНайденныхСтрок.Индекс(СтрокаСписка) < (СписокНайденныхСтрок.Количество()-1) Тогда
					ВторойЭлемент = СписокНайденныхСтрок[СписокНайденныхСтрок.Индекс(СтрокаСписка)+1].Значение.ИмяРеквизита;
				КонецЕсли;
			Иначе
				Если СписокНайденныхСтрок.Индекс(СтрокаСписка) > 0 Тогда
					ВторойЭлемент = СписокНайденныхСтрок[СписокНайденныхСтрок.Индекс(СтрокаСписка)-1].Значение.ИмяРеквизита;
				КонецЕсли;
			КонецЕсли;
			// -CRM
			Результат = Новый Структура("ПоменятьМестамиЭлементы, ПервыйЭлемент, ВторойЭлемент", Истина, ПервыйЭлемент, ВторойЭлемент);
			ОбновитьКонтактнуюИнформациюФормы(Форма, Результат);
		КонецЕсли;
		
	ИначеЕсли ТипКонтактнойИнформации = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
		
		Результат = Новый Структура("ИмяРеквизита", ИмяРеквизитаИсточник);
		СтрокаПотребитель = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Результат)[0];
		
		Комментарий = СтрокаПотребитель.Комментарий; // Сохраняем старый комментарий.
		Если СтрокаПотребитель.Свойство("МеждународныйФорматАдреса") И СтрокаПотребитель.МеждународныйФорматАдреса Тогда
			
			ЗаполнитьЗначенияСвойств(СтрокаПотребитель, НайденнаяСтрока, "Комментарий");
			ПредставлениеАдреса = СтроковыеФункцииКлиент.СтрокаЛатиницей(НайденнаяСтрока.Представление);
			СтрокаПотребитель.Представление        = ПредставлениеАдреса;
			Форма[СтрокаПотребитель.ИмяРеквизита]  = ПредставлениеАдреса;
			СтрокаПотребитель.Значение             = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(ПредставлениеАдреса, ТипКонтактнойИнформации);
			
		Иначе
			
			ЗаполнитьЗначенияСвойств(СтрокаПотребитель, НайденнаяСтрока, "Значение, Представление,Комментарий");
			Форма[СтрокаПотребитель.ИмяРеквизита] = НайденнаяСтрока.Представление;
			
		КонецЕсли;
		
		Форма.Модифицированность = Истина;
		Результат = Новый Структура();
		Результат.Вставить("ОбновитьКонтекстноеМеню", Истина);
		Результат.Вставить("ИмяРеквизита", СтрокаПотребитель.ИмяРеквизита);
		Результат.Вставить("Комментарий", СтрокаПотребитель.Комментарий);
		Результат.Вставить("ИмяЭлементаДляРазмещения", НайденнаяСтрока.ИмяЭлементаДляРазмещения);
		ОбновитьКонтактнуюИнформациюФормы(Форма, Результат);
		
	ИначеЕсли ТипКонтактнойИнформации = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты") Тогда
		АдресПочты = Форма.Элементы[ИмяРеквизита].ТекстРедактирования;
		УправлениеКонтактнойИнформациейКлиент.СоздатьЭлектронноеПисьмо("", АдресПочты, ТипКонтактнойИнформации);
	ИначеЕсли ТипКонтактнойИнформации = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон") Тогда
		
		Параметры = Новый Структура("НомерТелефона, ТипКонтактнойИнформации, Форма");
		Параметры.НомерТелефона = Форма.Элементы[ИмяРеквизита].ТекстРедактирования;
		Параметры.ТипКонтактнойИнформации = ТипКонтактнойИнформации;
		Параметры.Форма = Форма;
		
		Если ПустаяСтрока(Параметры.НомерТелефона) Тогда
			ПоказатьПредупреждение(,НСтр("ru='Для совершения звонка или отправки SMS требуется ввести номер телефона.';en='To call or send SMS message, enter the phone number.'"));
			Возврат;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ОтправкаSMS") Тогда
			Список = Новый СписокЗначений;
			Список.Добавить("Позвонить", НСтр("ru='Позвонить';en='Call'"),, БиблиотекаКартинок.CRM_ТелефонныйЗвонок);
			Список.Добавить("ОтправитьSMS", НСтр("ru='Отправить SMS...';en='Send Text ...'"),, БиблиотекаКартинок.SMS4B_ИсходящееСообщение);
			ОповещениеМеню = Новый ОписаниеОповещения("ПослеВыбораИзМенюТелефон", ЭтотОбъект, Параметры);
			Форма.ПоказатьВыборИзМеню(ОповещениеМеню, Список, Форма.Элементы[ИмяКоманды]);
		Иначе
			ПозвонитьПоТелефону(Форма);
		КонецЕсли;
		
	ИначеЕсли ТипКонтактнойИнформации = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Skype") Тогда
		Параметры = Новый Структура("ЛогинSkype");
		Параметры.ЛогинSkype = Форма.Элементы[ИмяРеквизита].ТекстРедактирования;
		Список = Новый СписокЗначений;
		Список.Добавить("Позвонить", НСтр("ru='Позвонить';en='Call'"));
		Список.Добавить("НачатьЧат", НСтр("ru='Начать чат';en='Start a chat'"));
		ОповещениеМеню = Новый ОписаниеОповещения("ПослеВыбораИзМенюSkype", ЭтотОбъект, Параметры);
		Форма.ПоказатьВыборИзМеню(ОповещениеМеню, Список, Форма.Элементы[ИмяКоманды]);
		
	ИначеЕсли ТипКонтактнойИнформации = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ВебСтраница") Тогда
		АдресСсылки = Форма.Элементы[ИмяРеквизита].ТекстРедактирования;
		УправлениеКонтактнойИнформациейКлиент.ПерейтиПоВебСсылке("", АдресСсылки, ТипКонтактнойИнформации);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс


#Область СлужебныйПрограммныйИнтерфейс

Процедура ПослеЗапускаПриложения(ВыбранныйЭлемент, Параметры) Экспорт
	// Процедура заглушка, т.к. НачатьЗапускПриложения требуется наличие обработчика оповещения.
	Результат = Истина;
КонецПроцедуры

Процедура ПослеВыбораИзМенюSkype(ВыбранныйЭлемент, Параметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	#Если НЕ ВебКлиент Тогда
		Если ПустаяСтрока(ПрограммаТелефонииУстановлена("skype")) Тогда
			ПоказатьПредупреждение(Неопределено, НСтр("ru='Для совершения звонка по Skype требуется установить программу.';en='To make a Skype call, install the application.'"));
			Возврат;
		КонецЕсли;
	#КонецЕсли
	
	СтрокаЗапуска = "skype:" + Параметры.ЛогинSkype;
	Если ВыбранныйЭлемент.Значение = "Позвонить" Тогда
		СтрокаЗапуска = СтрокаЗапуска + "?call";
	ИначеЕсли ВыбранныйЭлемент.Значение = "НачатьЧат" Тогда
		СтрокаЗапуска = СтрокаЗапуска + "?chat";
	Иначе
		СтрокаЗапуска = СтрокаЗапуска + "?userinfo";
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ЗапускSkype", ЭтотОбъект, СтрокаЗапуска);
	ТекстСообщения = НСтр("ru='Для запуска Skype необходимо установить расширение работы с файлами.';en='Run Skype, install the file operation extension.'");
	ОбщегоНазначенияКлиент.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(Оповещение, ТекстСообщения);

КонецПроцедуры

Процедура ПослеВыбораИзМенюТелефон(ВыбранныйЭлемент, Параметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Если ВыбранныйЭлемент.Значение = "ОтправитьSMS" Тогда
			Если НЕ ЗначениеЗаполнено(Параметры.Форма.Объект.Ссылка) Тогда
				ТекстСообщения = НСтр("ru='Необходимо записать элемент';en='It is necessary to write down an element'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			ИначеЕсли CRM_ОбщегоНазначенияКлиент.смсПроверитьДоступностьSMS4B() Тогда
				Если ПустаяСтрока(Параметры.НомерТелефона) Тогда Возврат; КонецЕсли;
				Структура = Новый Структура();
				Структура.Вставить("Ссылка", Параметры.Форма.Объект.Ссылка);
				Структура.Вставить("Телефон", SMS4B_ОтправкаSMS.ФорматироватьНомер(Параметры.НомерТелефона));
				ПараметрыФормы = Новый Структура();
				ПараметрыФормы.Вставить("Основание", Структура);
				ПараметрыФормы.Вставить("СокращеннаяФорма", Истина);
				ОткрытьФорму("Документ.СообщениеSMS.ФормаОбъекта", ПараметрыФормы);
			КонецЕсли;
		Иначе
			ПозвонитьПоТелефону(Параметры.Форма);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ЗапускSkype(РасширениеПодключено, СтрокаЗапуска) Экспорт
	
	Если РасширениеПодключено Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗапускаПриложения", ЭтотОбъект);
		НачатьЗапускПриложения(Оповещение, СтрокаЗапуска);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПредставлениеНачалоВыбораЗавершение(Знач РезультатЗакрытия, Знач ДополнительныеПараметры) Экспорт
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Если ДополнительныеПараметры.Свойство("ОбновитьКонтекстноеМеню") 
			И ДополнительныеПараметры.ОбновитьКонтекстноеМеню Тогда
				Результат = Новый Структура();
				Результат.Вставить("ОбновитьКонтекстноеМеню",  Истина);
				Результат.Вставить("ИмяЭлементаДляРазмещения", ДополнительныеПараметры.ИмяЭлементаРазмещения);
				ОбновитьКонтактнуюИнформациюФормы(ДополнительныеПараметры.Форма, Результат);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ДанныеЗаполнения = ДополнительныеПараметры.ДанныеЗаполнения;
	ДанныеНаФорме    = ДополнительныеПараметры.ДанныеСтроки;
	Результат        = ДополнительныеПараметры.Результат;
	Элемент          = ДополнительныеПараметры.Элемент;
	Форма            = ДополнительныеПараметры.Форма;
	
	ТекстПредставления = РезультатЗакрытия.Представление;
	ЗначенияПолей      = РезультатЗакрытия.КонтактнаяИнформация;
	Значение           = РезультатЗакрытия.Значение;
	Комментарий        = РезультатЗакрытия.Комментарий;
	
	Если ДанныеНаФорме.Свойство("ХранитьИсториюИзменений") И ДанныеНаФорме.ХранитьИсториюИзменений Тогда
		КонтактнаяИнформацияОписаниеДополнительныхРеквизитов = ДанныеЗаполнения.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов;
		Отбор = Новый Структура("Вид", ДанныеНаФорме.Вид);
		НайденныеСтроки = КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Отбор);
		Для Каждого СтрокаКонтактнойИнформации Из НайденныеСтроки Цикл
			КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Удалить(СтрокаКонтактнойИнформации);
		КонецЦикла;
		
		Отбор = Новый Структура("Вид", ДанныеНаФорме.Вид);
		НайденныеСтроки = РезультатЗакрытия.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Отбор);
		
		Если НайденныеСтроки.Количество() > 1 Тогда
			
			СтрокаСДействующимАдресом = Неопределено;
			МинимальнаяДата = Неопределено;
			
			Для Каждого СтрокаКонтактнойИнформации Из НайденныеСтроки Цикл
				
				НоваяКонтактнаяИнформация = КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяКонтактнаяИнформация, СтрокаКонтактнойИнформации);
				НоваяКонтактнаяИнформация.ИмяЭлементаДляРазмещения = ДополнительныеПараметры.ИмяЭлементаРазмещения;
				
				Если СтрокаСДействующимАдресом = Неопределено
					ИЛИ СтрокаКонтактнойИнформации.ДействуетС > СтрокаСДействующимАдресом.ДействуетС Тогда
						СтрокаСДействующимАдресом = СтрокаКонтактнойИнформации;
				КонецЕсли;
				Если МинимальнаяДата = Неопределено
					ИЛИ СтрокаКонтактнойИнформации.ДействуетС < МинимальнаяДата Тогда
						МинимальнаяДата = СтрокаКонтактнойИнформации.ДействуетС;
				КонецЕсли;
				
			КонецЦикла;
			
			// Исправление некорректных адресов, без первоначальной даты заполнения
			Если ЗначениеЗаполнено(МинимальнаяДата) Тогда
				Отбор = Новый Структура("ДействуетС", МинимальнаяДата);
				СтрокиСМинимальнойДатой = КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Отбор);
				Если СтрокиСМинимальнойДатой.Количество() > 0 Тогда
					СтрокиСМинимальнойДатой[0].ДействуетС = Дата(1, 1, 1);
				КонецЕсли;
			КонецЕсли;
			
			Если СтрокаСДействующимАдресом <> Неопределено Тогда
				ТекстПредставления = СтрокаСДействующимАдресом.Представление;
				ЗначенияПолей      = СтрокаСДействующимАдресом.ЗначенияПолей;
				Значение           = СтрокаСДействующимАдресом.Значение;
				Комментарий        = СтрокаСДействующимАдресом.Комментарий;
			КонецЕсли;
			
		ИначеЕсли НайденныеСтроки.Количество() = 1 Тогда
			НоваяКонтактнаяИнформация = КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяКонтактнаяИнформация, НайденныеСтроки[0],, "ДействуетС");
			НоваяКонтактнаяИнформация.ИмяЭлементаДляРазмещения = ДополнительныеПараметры.ИмяЭлементаРазмещения;
			ДанныеНаФорме.ДействуетС = Дата(1, 1, 1);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДополнительныеПараметры.ЭтоТабличнаяЧасть Тогда
		ДанныеЗаполнения[Элемент.Имя + "Значение"]      = РезультатЗакрытия.Значение;
		
	Иначе
		Форма.Элементы.Найти(Элемент.Имя).РасширеннаяПодсказка.Заголовок = Комментарий;
		
		ДанныеНаФорме.Представление = ТекстПредставления;
		ДанныеНаФорме.Значение      = РезультатЗакрытия.Значение;
		ДанныеНаФорме.Комментарий   = Комментарий;
	КонецЕсли;
	
	Если РезультатЗакрытия.Свойство("АдресВВидеГиперссылки")
		И РезультатЗакрытия.АдресВВидеГиперссылки
		И НЕ ЗначениеЗаполнено(ТекстПредставления) Тогда
			ДанныеЗаполнения[Элемент.Имя] = УправлениеКонтактнойИнформациейКлиентСервер.ТекстПустогоАдресаВВидеГиперссылки();
	Иначе
		ДанныеЗаполнения[Элемент.Имя] = ТекстПредставления;
	КонецЕсли;
	
	Если РезультатЗакрытия.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
		Результат.Вставить("ОбновитьКонтекстноеМеню", Истина);
	КонецЕсли;
	
	// +СофтФон
	Если РезультатЗакрытия.Свойство("сфпВремяЗадержкиНабораДобавочногоНомера") И
		 ДанныеНаФорме.Свойство("сфпВремяЗадержкиНабораДобавочногоНомера") Тогда
		ДанныеНаФорме.сфпВремяЗадержкиНабораДобавочногоНомера = РезультатЗакрытия.сфпВремяЗадержкиНабораДобавочногоНомера;
	КонецЕсли;
	// -СофтФон
	
	Форма.Модифицированность = Истина;
	ОбновитьКонтактнуюИнформациюФормы(Форма, Результат);
КонецПроцедуры

Процедура КонтактнаяИнформацияДобавитьПолеВводаЗавершение(Знач ВыбранныйЭлемент, Знач ДополнительныеПараметры) Экспорт
	Если ВыбранныйЭлемент = Неопределено Тогда
		// Отказ от выбора
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура();
	Результат.Вставить("ДобавляемыйВид", ВыбранныйЭлемент.Значение);
	Результат.Вставить("ИмяЭлементаДляРазмещения", ДополнительныеПараметры.ИмяЭлементаДляРазмещения);
	Результат.Вставить("ИмяКоманды", ДополнительныеПараметры.ИмяКоманды);
	Если ВыбранныйЭлемент.Значение.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
		Результат.Вставить("ОбновитьКонтекстноеМеню", Истина);
	КонецЕсли;
	
	ОбновитьКонтактнуюИнформациюФормы(ДополнительныеПараметры.Форма, Результат);
КонецПроцедуры

#КонецОбласти // СлужебныйПрограммныйИнтерфейс


#Область СлужебныеПроцедурыИФункции

// Возвращает строку дополнительных значений по имени реквизита.
//
// Параметры:
//    Форма   - ФормаКлиентскогоПриложения - передаваемая форма.
//    Элемент - ДанныеФормыСтруктураСКоллекцией - данные формы.
//
// Возвращаемое значение:
//    СтрокаКоллекции - найденные данные.
//    Неопределено    - при отсутствии данных.
//
Функция ПолучитьСтрокуДополнительныхЗначений(Форма, Элемент, ЭтоТабличнаяЧасть = Ложь)
	
	Отбор = Новый Структура("ИмяРеквизита", Элемент.Имя);
	Строки = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Отбор);
	ДанныеСтроки = ?(Строки.Количество() = 0, Неопределено, Строки[0]);
	
	Если ЭтоТабличнаяЧасть И ДанныеСтроки <> Неопределено Тогда
		
		ПутьКСтроке = Форма.Элементы[Форма.ТекущийЭлемент.Имя].ТекущиеДанные;
		
		ДанныеСтроки.Представление = ПутьКСтроке[Элемент.Имя];
		ДанныеСтроки.Значение      = ПутьКСтроке[Элемент.Имя + "Значение"];
		
	КонецЕсли;
	
	Возврат ДанныеСтроки;
	
КонецФункции

Функция ЭтоТабличнаяЧасть(Элемент)
	
	Родитель = Элемент.Родитель;
	
	Пока ТипЗнч(Родитель) <> Тип("ФормаКлиентскогоПриложения") Цикл
		
		Если ТипЗнч(Родитель) = Тип("ТаблицаФормы") Тогда
			Возврат Истина;
		КонецЕсли;
		
		Родитель = Родитель.Родитель;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Определение команды контекстного меню.
Функция КомандаКонтекстногоМеню(ИмяКоманды)
	
	Результат = Новый Структура("Команда, НаправлениеПеремещения, ИмяРеквизита", Неопределено, 0, Неопределено);
	
	ИмяРеквизита = ?(СтрНачинаетсяС(ИмяКоманды, "КонтекстноеМенюПодменю"),
		СтрЗаменить(ИмяКоманды, "КонтекстноеМенюПодменю", ""), СтрЗаменить(ИмяКоманды, "КонтекстноеМеню", ""));
		
	Если СтрНачинаетсяС(ИмяРеквизита, "Вверх") Тогда
		Результат.ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "Вверх", "");
		Результат.НаправлениеПеремещения = -1;
		Результат.Команда = "Вверх";
	ИначеЕсли СтрНачинаетсяС(ИмяРеквизита, "История") Тогда
		Результат.ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "История", "");
		Результат.Команда = "История";
	ИначеЕсли СтрНачинаетсяС(ИмяРеквизита, "Вниз") Тогда
		Результат.ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "Вниз", "");
		Результат.НаправлениеПеремещения = 1;
		Результат.Команда = "Вниз";
	ИначеЕсли СтрНачинаетсяС(ИмяРеквизита, "КартаЯндекс") Тогда
		Результат.ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "КартаЯндекс", "");
		Результат.Команда = "КартаЯндекс";
	ИначеЕсли СтрНачинаетсяС(ИмяРеквизита, "КартаGoogle") Тогда
		Результат.ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "КартаGoogle", "");
		Результат.Команда = "КартаGoogle";
	Иначе
		Результат.ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "Комментарий", "");
		Результат.Команда = "Комментарий";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Ввод комментария из контекстного меню.
Процедура ВвестиКомментарий(Знач Форма, Знач ИмяРеквизита, Знач НайденнаяСтрока, Знач Результат)
	Комментарий = НайденнаяСтрока.Комментарий;
	
	Оповещение = Новый ОписаниеОповещения("ВвестиКомментарийЗавершение", ЭтотОбъект, Новый Структура);
	Оповещение.ДополнительныеПараметры.Вставить("Форма", Форма);
	Оповещение.ДополнительныеПараметры.Вставить("ИмяРеквизитаКомментария", "Комментарий" + ИмяРеквизита);
	Оповещение.ДополнительныеПараметры.Вставить("НайденнаяСтрока", НайденнаяСтрока);
	Оповещение.ДополнительныеПараметры.Вставить("ПредыдущийКомментарий", Комментарий);
	Оповещение.ДополнительныеПараметры.Вставить("Результат", Результат);
	Оповещение.ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", НайденнаяСтрока.ИмяЭлементаДляРазмещения);
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(Оповещение, Комментарий, 
		НСтр("ru='Комментарий';en='Comment'"));
КонецПроцедуры

// Завершение немодального диалога.
Процедура ВвестиКомментарийЗавершение(Знач Комментарий, Знач ДополнительныеПараметры) Экспорт
	Если Комментарий = Неопределено Или Комментарий = ДополнительныеПараметры.ПредыдущийКомментарий Тогда
		// Отказ от ввода или нет изменений.
		Возврат;
	КонецЕсли;
	
	КомментарийБылПустой  = ПустаяСтрока(ДополнительныеПараметры.ПредыдущийКомментарий);
	КомментарийСталПустой = ПустаяСтрока(Комментарий);
	
	ДополнительныеПараметры.НайденнаяСтрока.Комментарий = Комментарий;
	
	Если КомментарийБылПустой И Не КомментарийСталПустой Тогда
		ДополнительныеПараметры.Результат.Вставить("ЭтоДобавлениеКомментария", Истина);
	ИначеЕсли Не КомментарийБылПустой И КомментарийСталПустой Тогда
		ДополнительныеПараметры.Результат.Вставить("ЭтоДобавлениеКомментария", Ложь);
	Иначе
		Если ДополнительныеПараметры.Форма.Элементы.Найти(ДополнительныеПараметры.ИмяРеквизитаКомментария) <> Неопределено Тогда
			Элемент = ДополнительныеПараметры.Форма.Элементы[ДополнительныеПараметры.ИмяРеквизитаКомментария];
			Элемент.Заголовок = Комментарий;
		Иначе
			ДополнительныеПараметры.Результат.Вставить("ЭтоДобавлениеКомментария", Истина);
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеПараметры.Форма.Модифицированность = Истина;
	ОбновитьКонтактнуюИнформациюФормы(ДополнительныеПараметры.Форма, ДополнительныеПараметры.Результат)
КонецПроцедуры

Процедура ПозвонитьПоТелефону(Знач Форма)
	
	// +СофтФон
	сфпСофтФонПроКлиентПереопределяемый.сфпПодключаемый_ПозвонитьНаНомер(Форма, Форма.Объект);	
	// -СофтФон
	
КонецПроцедуры

Процедура СовершитьЗвонок(РасширениеПодключено, СтрокаЗапуска) Экспорт
	
	Если РасширениеПодключено Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗапускаПриложения", ЭтотОбъект);
		НачатьЗапускПриложения(Оповещение, СтрокаЗапуска);
	КонецЕсли;
	
КонецПроцедуры

// Контекстный вызов
Процедура ОбновитьКонтактнуюИнформациюФормы(Форма, Результат)

	Форма.Подключаемый_ОбновитьКонтактнуюИнформацию(Результат);
	
КонецПроцедуры

// Проверяет, установлена ли программа телефонии на компьютер.
//  Проверка возможна только в тонком клиенте для Windows.
//
// Параметры:
//  ИмяПротокола - Строка - Имя проверяемого URI протокола, возможные варианты "skype", "tel", "sip".
//                          Если параметр не указан, то проверяются все протоколы. 
// 
// Возвращаемое значение:
//  Строка - имя доступного URI протокола зарегистрирована в реестре. Пустая строка - если протокол не доступен.
//  Неопределенно если проверка не возможна.
//
Функция ПрограммаТелефонииУстановлена(ИмяПротокола = Неопределено)
	
		Если НЕ ОбщегоНазначенияКлиентСервер.ЭтоLinuxКлиент() Тогда
			Если ЗначениеЗаполнено(ИмяПротокола) Тогда
				Возврат ?(ИмяПротоколаЗарегистрированоВРеестре(ИмяПротокола), ИмяПротокола, "");
			Иначе
				СписокПротоколов = Новый Массив;
				СписокПротоколов.Добавить("tel");
				СписокПротоколов.Добавить("sip");
				СписокПротоколов.Добавить("skype");
				Для каждого ИмяПротокола Из СписокПротоколов Цикл
					Если ИмяПротоколаЗарегистрированоВРеестре(ИмяПротокола) Тогда
						Возврат ИмяПротокола;
					КонецЕсли;
				КонецЦикла;
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
	
	Возврат "";
КонецФункции

Функция ИмяПротоколаЗарегистрированоВРеестре(ИмяПротокола)
	#Если МобильныйКлиент Тогда
		Возврат Ложь;
	#Иначе	
	Попытка
		Оболочка = Новый COMОбъект("Wscript.Shell");
		Результат = Оболочка.RegRead("HKEY_CLASSES_ROOT\" + ИмяПротокола + "\");
	Исключение
		Возврат Ложь;
	КонецПопытки;
	Возврат Истина;
	#КонецЕсли
КонецФункции

Процедура ОбновитьКонтекстноеМеню(Форма, ИмяЭлементаДляРазмещения)
	
	ПараметрыКонтактнойИнформации = Форма.ПараметрыКонтактнойИнформации[ИмяЭлементаДляРазмещения];
	ВсеСтроки = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов;
	НайденныеСтроки = ВсеСтроки.НайтиСтроки( 
		Новый Структура("Тип, ЭтоРеквизитТабличнойЧасти", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"), Ложь));
		
	ОбщееКоличествоКоманд = 0;
	Для Каждого СтрокаКИ Из ВсеСтроки Цикл
		
		Если ОбщееКоличествоКоманд > 50 Тогда // Ограничение для большого количества адресов на форме
			Прервать;
		КонецЕсли;
		
		Если СтрокаКИ.Тип <> ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
			Продолжить;
		КонецЕсли;
		
		ПодменюКопироватьАдреса = Форма.Элементы.Найти("ПодменюКопироватьАдреса" + СтрокаКИ.ИмяРеквизита);
		КонтекстноеПодменюКопироватьАдреса = Форма.Элементы.Найти("КонтекстноеПодменюКопироватьАдреса" + СтрокаКИ.ИмяРеквизита);
		Если ПодменюКопироватьАдреса <> Неопределено И КонтекстноеПодменюКопироватьАдреса = Неопределено Тогда
			Продолжить;
		КонецЕсли;
			
		КоличествоКомандВПодменю = 0;
		СписокАдресовВПодменю = Новый Соответствие();
		СписокАдресовВПодменю.Вставить(ВРег(СтрокаКИ.Представление), Истина);
		
		Для Каждого Адрес Из НайденныеСтроки Цикл
			
			Если КоличествоКомандВПодменю > 7 Тогда // Ограничение для большого количества адресов на форме
				Прервать;
			КонецЕсли;
			
			Если Адрес.ЭтоИсторическаяКонтактнаяИнформация Или Адрес.ИмяРеквизита = СтрокаКИ.ИмяРеквизита Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяКоманды = "МенюПодменюАдрес" + СтрокаКИ.ИмяРеквизита + "_" + Адрес.ИмяРеквизита;
			Команда = Форма.Команды.Найти(ИмяКоманды);
			Если Команда = Неопределено Тогда
				Команда = Форма.Команды.Добавить(ИмяКоманды);
				Команда.Подсказка = НСтр("ru='Скопировать адрес';en='Copy address'");
				Команда.Действие = "Подключаемый_КонтактнаяИнформацияВыполнитьКоманду";
				Команда.ИзменяетСохраняемыеДанные = Истина;
				
				ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяКоманды, 9, Истина);
				КоличествоКомандВПодменю = КоличествоКомандВПодменю + 1;
			КонецЕсли;
			
			ПредставлениеАдреса = ?(СтрокаКИ.МеждународныйФорматАдреса,
				СтроковыеФункцииКлиент.СтрокаЛатиницей(Адрес.Представление), Адрес.Представление);
			
			Если СписокАдресовВПодменю[ВРег(Адрес.Представление)] <> Неопределено Тогда
				ПредставлениеАдреса = "";
			Иначе
				СписокАдресовВПодменю.Вставить(ВРег(Адрес.Представление), Истина);
			КонецЕсли;
			
			Если ПодменюКопироватьАдреса <> Неопределено Тогда
				ДобавитьКнопкуСкопироватьАдрес(Форма, ИмяКоманды,
					ПредставлениеАдреса, ПараметрыКонтактнойИнформации, ПодменюКопироватьАдреса);
				КонецЕсли;
				
			Если КонтекстноеПодменюКопироватьАдреса <> Неопределено Тогда
				ДобавитьКнопкуСкопироватьАдрес(Форма, ИмяКоманды, 
					ПредставлениеАдреса, ПараметрыКонтактнойИнформации, КонтекстноеПодменюКопироватьАдреса);
			КонецЕсли;
			
		КонецЦикла;
		ОбщееКоличествоКоманд = ОбщееКоличествоКоманд + КоличествоКомандВПодменю;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьКнопкуСкопироватьАдрес(Форма, ИмяКоманды, ЗаголовокЭлемента, ПараметрыКонтактнойИнформации, Подменю)
	
	ИмяЭлемента = Подменю.Имя + "_" + ИмяКоманды;
	Кнопка = Форма.Элементы.Найти(ИмяЭлемента);
	Если Кнопка = Неопределено Тогда
		Кнопка = Форма.Элементы.Добавить(ИмяЭлемента, Тип("КнопкаФормы"), Подменю);
		Кнопка.ИмяКоманды = ИмяКоманды;
		ПараметрыКонтактнойИнформации.ДобавленныеЭлементы.Добавить(ИмяЭлемента, 1);
	КонецЕсли;
	Кнопка.Заголовок = ЗаголовокЭлемента;
	Кнопка.Видимость = ЗначениеЗаполнено(ЗаголовокЭлемента);

КонецПроцедуры

#Область МетодыCRM

// Событие ПриИзменении в колонке Представление таблицы контактной информации.
Функция CRM_ПолучитьТипПроверитьЗаполнение(Форма, Элемент) Экспорт
	
	ДанныеЗаполнения = Форма;
	
	// Если это очистка, то сбрасываем представление.
	ДанныеСтроки = ПолучитьСтрокуДополнительныхЗначений(Форма, Элемент, Ложь);
	Если ДанныеСтроки=Неопределено ИЛИ НЕ ДанныеСтроки.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты") Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Текст = Элемент.ТекстРедактирования;
	Если ПустаяСтрока(Текст) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат CRM_ОбщегоНазначенияКлиентСервер.АнализАдресаЭП(Текст);
	
КонецФункции

// Событие Нажатие в поле "Основной для связи" таблицы контактной информации.
//
Процедура ОсновнойДляСвязиНажатие(Форма, Элемент) Экспорт
	
	ИмяРеквизита = СтрЗаменить(Элемент.Имя, "ОсновнойДляСвязи", "");
	НайденныеСтроки = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("ИмяРеквизита", ИмяРеквизита));
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НайденныеСтроки[0].CRM_ОсновнойДляСвязи = (НЕ НайденныеСтроки[0].CRM_ОсновнойДляСвязи);
	Элемент.Картинка = ?(НайденныеСтроки[0].CRM_ОсновнойДляСвязи, БиблиотекаКартинок.CRM_ЗвездочкаГолубая, БиблиотекаКартинок.CRM_ЗвездочкаСерая);
	Форма.Элементы[ИмяРеквизита].Шрифт	= Новый Шрифт(Форма.Элементы[ИмяРеквизита].Шрифт, , , Истина, , , );
	Форма.ТекущийЭлемент = Форма.Элементы[ИмяРеквизита];
	
	Если НЕ НайденныеСтроки[0].CRM_ОсновнойДляСвязи Тогда
		Возврат;
	КонецЕсли;
	
	// Производим корректировку остальных полей текущего типа КИ.
	Для Каждого СтрокаТабличнойЧасти Из Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Тип", НайденныеСтроки[0].Тип)) Цикл
		
		Если СтрокаТабличнойЧасти.ИмяРеквизита = ИмяРеквизита Тогда
			Продолжить;
		КонецЕсли;
		Форма.Элементы[СтрокаТабличнойЧасти.ИмяРеквизита].Шрифт	= Новый Шрифт(Форма.Элементы[СтрокаТабличнойЧасти.ИмяРеквизита].Шрифт, , , Ложь, , , );
		СтрокаТабличнойЧасти.CRM_ОсновнойДляСвязи = Ложь;
		Форма.Элементы["ОсновнойДляСвязи" + СтрокаТабличнойЧасти.ИмяРеквизита].Картинка = БиблиотекаКартинок.CRM_ЗвездочкаСерая;
	КонецЦикла;
	
КонецПроцедуры // ОсновнойДляСвязиНажатие()

// Используется при проверке дублей на основании значения контактной информации.
// Получает значение КИ и передает его дальше.
//
// Параметры:
//     Форма             - ФормаКлиентскогоПриложения   - Форма владельца контактной информации.
//     Элемент           - ПолеФормы          - Элемент формы, содержащий представление контактной информации.
//     Оповещение 		 - ОписаниеОповещения - Оповещения для вызова
//
Процедура ВыполнитьПоискДублейПоЗначению(Форма, Элемент, Оповещение) Экспорт
	
	ДанныеСтроки = ПолучитьСтрокуДополнительныхЗначений(Форма, Элемент, Ложь);
	
	ВыполнитьОбработкуОповещения(Оповещение, ДанныеСтроки);
	
КонецПроцедуры

// +Рарус alexpr

Процедура CRM_ЗапуститьДлительнуюОперациюПрозвонитьМессенджеры(Параметры) Экспорт
	
	ИмяРеквизитаКИ = Неопределено;
	Параметры.Свойство("ИмяРеквизитаКИ", ИмяРеквизитаКИ);
	
	ДлительнаяОперация = CRM_РаботаСМессенджерамиСервер.НачатьПрозвонМессенджеров(Параметры.Ссылка,
		 Параметры.МассивТелефонныхНомеров, Параметры.МассивИсключаемыхМессенджеров,
		 ИмяРеквизитаКИ);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Параметры.Форма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("Подключаемый_ПрозвонМессенджеровЗавершение",
		 Параметры.Форма,
		 Параметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

Процедура CRM_ПрозвонМессенджеровЗавершение(РезультатПрозвона, Параметры) Экспорт
	
	Форма = Параметры.Форма;
	
	Если Параметры.Свойство("БезЗаполненияПолей") Тогда
		
	Иначе
		
		СписокДобавляемыхЭлементов =
			Форма.ПараметрыКонтактнойИнформации[Параметры.ИмяЭлементаДляРазмещения].СписокДобавляемыхЭлементов;
		
		Для Каждого ЭлементРезультата Из РезультатПрозвона Цикл
		
			Для Каждого ДобавляемыйЭлемент Из СписокДобавляемыхЭлементов Цикл
				
				Если ДобавляемыйЭлемент.Значение.Ссылка = ЭлементРезультата.ВидКИ Тогда
					
					СуществующиеСтроки = CRM_НайтиПустыеСтрокиДополнительныхЗначенийПоВидуКИ(Форма, ЭлементРезультата.ВидКИ);
					
					СтрокаИсточник = Неопределено;
					Если Параметры.Свойство("ПрозвонВсехНомеров") Тогда
						СтрокаИсточник = Параметры.ДополнительныеДанныеНомеровСоответствие[ЭлементРезультата.НомерТелефона];
					Иначе
						СтрокаИсточник = Параметры.НайденнаяСтрока;
					КонецЕсли;
					
					Если СуществующиеСтроки.Количество() > 0 Тогда
						
						ЗаполнитьЗначенияСвойств(СуществующиеСтроки[0], СтрокаИсточник, "Значение,Представление,Родитель,Колонка");
						Форма[СуществующиеСтроки[0].ИмяРеквизита] = СуществующиеСтроки[0].Представление;
						
					Иначе
						
						ДополнительныеПараметры = Новый Структура;
						ДополнительныеПараметры.Вставить("Форма", Форма);
						ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", Параметры.ИмяЭлементаДляРазмещения);
						ДополнительныеПараметры.Вставить("ИмяКоманды", "");
						ДополнительныеПараметры.Вставить("ЭтоПоследнийЭлемент", СписокДобавляемыхЭлементов.Количество() = 1);
						
						КонтактнаяИнформацияДобавитьПолеВводаЗавершение(ДобавляемыйЭлемент, ДополнительныеПараметры);
						
						ДанныеСтроки = ПолучитьСтрокуДополнительныхЗначений(Форма, Форма.ТекущийЭлемент);
						Если ДанныеСтроки = Неопределено Тогда 
							Продолжить;
						КонецЕсли;
						ЗаполнитьЗначенияСвойств(ДанныеСтроки, СтрокаИсточник, "Значение,Представление,Родитель,Колонка");
						Форма[Форма.ТекущийЭлемент.Имя] = ДанныеСтроки.Представление;
						
					КонецЕсли;
					
					Форма.Модифицированность = Истина;
					
				КонецЕсли;
				
			КонецЦикла;
		
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция CRM_НайтиПустыеСтрокиДополнительныхЗначенийПоВидуКИ(Форма, ВидКИ, ЭтоТабличнаяЧасть = Ложь)
	
	Отбор = Новый Структура("Вид, Значение", ВидКИ, "");
	Строки = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Отбор);
	
	Возврат Строки;
	
КонецФункции

// -Рарус alexpr

#КонецОбласти // МетодыCRM

#Область НовыеМетодыCRM

Процедура КонтактнаяИнформацияНажатие(Форма, Команда) Экспорт
	
	Если СтрНайти(Команда.Имя, "КнопкаПодменю") > 0 Тогда
		Форма.Элементы[СтрЗаменить(Команда.Имя, "Кнопка", "")].Показать();
		Возврат;
	ИначеЕсли СтрНайти(Команда.Имя, "ЭлементСпискаКИКонтактнаяИнформация") > 0 Тогда	
		ТекущиеСтрокаКИ = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("ИмяРеквизита", СтрЗаменить(Команда.Имя, "ЭлементСпискаКИ", "")));
	Иначе	
		ТекущиеСтрокаКИ = Форма.КонтактнаяИнформацияОбъектовОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("ИмяРеквизита", Команда.Имя));
	КонецЕсли;
	Если ТекущиеСтрокаКИ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ТекущаяСтрокаКИ = ТекущиеСтрокаКИ[0];
	Контакт = ?(ТекущаяСтрокаКИ.Свойство("Объект"), ТекущаяСтрокаКИ.Объект, Форма.Объект.Ссылка); 
	Если ТекущаяСтрокаКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон") Тогда
		Если НЕ сфпСофтФонПроКлиент.сфпПроверитьДоступностьСофтФон(Истина) Тогда Возврат; КонецЕсли;
		ДанныеЗаполнения	= Новый Структура;
		ДанныеЗаполнения.Вставить("Основание",	Форма.Объект.Ссылка);	
		ДополнительныеПараметры	= Новый Структура;
		ДополнительныеПараметры.Вставить("ДанныеЗаполнения",	ДанныеЗаполнения);
		сфпСофтФонПроКлиент.сфпПозвонить(ТекущаяСтрокаКИ.Представление, Контакт, ДополнительныеПараметры);
	ИначеЕсли ТекущаяСтрокаКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты") Тогда
	   	ПараметрыФормы = Новый Структура("Основание",Форма.Объект.Ссылка);
		ПараметрыФормы.Вставить("ДанныеЗаполнения", Форма.Объект.Ссылка);
		СписокАдресов = Новый СписокЗначений;
		СписокАдресов.Добавить(Контакт, ТекущаяСтрокаКИ.Представление);
		ПараметрыФормы.Вставить("Кому", СписокАдресов);
		ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	ИначеЕсли ТекущаяСтрокаКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ВебСтраница") Тогда
		АдресСайтаКомпании = ТекущаяСтрокаКИ.Представление;
		Если Найти(АдресСайтаКомпании, "://") = 0 Тогда
			АдресСайтаКомпании = "http://" + АдресСайтаКомпании;
		КонецЕсли;	
		ОбщегоНазначенияКлиент.ОткрытьНавигационнуюСсылку(АдресСайтаКомпании);
	ИначеЕсли ТекущаяСтрокаКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
		СписокКоманд = Новый СписокЗначений;
		СписокКоманд.Добавить("ПоказатьАдресНаЯндексКартах", НСтр("ru='Адрес на Яндекс.Картах';en='Address on Yandex.Maps'"),, БиблиотекаКартинок.ЯндексКарты);
		СписокКоманд.Добавить("ПоказатьАдресНаGoogleMaps", НСтр("ru='Адрес на Google Maps';en='Address on Google Maps'"),, БиблиотекаКартинок.GoogleMaps);
		Элемент = Форма.Элементы.Найти(Команда.Имя);
		ОписаниеОпопвещения = Новый ОписаниеОповещения("КонтактнаяИнформацияНажатиеПродолжение", ЭтотОбъект, ТекущаяСтрокаКИ);
		Форма.ПоказатьВыборИзМеню(ОписаниеОпопвещения, СписокКоманд, Элемент);
	КонецЕсли;
	
КонецПроцедуры

Процедура КонтактнаяИнформацияНажатиеПродолжение(Результат, СтрокаКИ) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Результат.Значение = "ПоказатьАдресНаЯндексКартах" Тогда
		УправлениеКонтактнойИнформациейКлиент.ПоказатьАдресНаКарте(СтрокаКИ.Представление, "Яндекс.Карты");
	ИначеЕсли Результат.Значение = "ПоказатьАдресНаGoogleMaps" Тогда
		УправлениеКонтактнойИнформациейКлиент.ПоказатьАдресНаКарте(СтрокаКИ.Представление, "GoogleMaps");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти // НовыеМетодыCRM

#КонецОбласти // СлужебныеПроцедурыИФункции
